app/Cells/KategoriDropdown.php

SELECT DISTINCT `kategori`
FROM `artikel`
WHERE kategori IS NOT NULL
---
    public function render()
    {
        $model = new ArtikelModel();
        $kategori = $model->select('kategori')
            ->distinct()
            ->where('kategori IS NOT NULL', null, false)
            ->findAll();