app/Controllers/AjaxController.php

    public function index()
    {
        $kategoriModel = new KategoriModel();
        $data = [
            'title' => 'Data Artikel',
            'kategori' => $kategoriModel->findAll()
---
SELECT *
FROM `kategori`

    public function delete($id)
    {
        $model = new ArtikelModel();

        if ($model->delete($id)) {
---
DELETE FROM `artikel`
WHERE `id` IN ('59')